<?php

namespace Models\Task02;

// Интерфейс Транспортное Средство
interface IVehicle {
    
    // 
}

('Денисов', 'Юстиниан', 'Митрофанович'),
('Новиков', 'Мирон', 'Богуславович'),
('Филиппов', 'Кондратий', 'Николаевич'),
('Савин', 'Геннадий', 'Филатович'),
('Лукин', 'Корнелий', 'Проклович'),
('Никитин', 'Семен', 'Григорьевич'),
('Соловьёв', 'Филипп', 'Альбертович'),
('Ширяев', 'Родион', 'Донатович'),
('Тихонов', 'Ипполит', 'Дамирович'),
('Одинцов', 'Аполлон', 'Тимофеевич'),
('Денисов', 'Юстиниан', 'Митрофанович'),
('Новиков', 'Мирон', 'Богуславович'),
('Филиппов', 'Кондратий', 'Николаевич'),
('Савин', 'Геннадий', 'Филатович'),
('Лукин', 'Корнелий', 'Проклович'),
('Никитин', 'Семен', 'Григорьевич'),
('Соловьёв', 'Филипп', 'Альбертович'),
('Ширяев', 'Родион', 'Донатович'),
('Тихонов', 'Ипполит', 'Дамирович'),
('Одинцов', 'Аполлон', 'Тимофеевич'),