-- Заполнение таблиц базы данных Polyclinic.db

-- таблица персональных данных
insert INTO Persons
    (Surname, [Name], Patronymic)
values ('Юрковский', 'Марк', 'Максимилианович'), /*  1 */
       ('Якубовская', 'Диана', 'Павловна'), /*  2 */
       ('Шапиро', 'Федор', 'Федорович'), /*  3 */
       ('Вожжаев', 'Сергей', 'Денисович'), /*  4 */
       ('Хроменко', 'Игорь', 'Владимирович'), /*  5 */
       ('Пелых', 'Марина', 'Ульяновна'), /*  6 */
       ('Лапотникова', 'Тамара', 'Оскаровна'), /*  7 */
       ('Огородников', 'Сергей', 'Иванович'), /*  8 */
       ('Яйло', 'Екатерина', 'Николаевна'), /*  9 */
       ('Лосева', 'Инна', 'Степановна'), /* 10 */
       ('Михайлович', 'Анна', 'Валентиновна'), /* 11 */
       ('Тарапата', 'Михаил', 'Исаакович'), /* 12 */
       ('Трубихин', 'Эдуард', 'Михайлович'), /* 13 */
       ('Чмыхало', 'Олег', 'Тарасович'), /* 14 */
       ('Князьков', 'Степан', 'Сидорович'), /* 15 */
       ('Потемкина', 'Наталья', 'Павловна'), /* 16 */
       ('Гритченко', 'Степан', 'Романович'), /* 17 */
       ('Селиванов', 'Александр', 'Михайлович'), /* 18 */
       ('Царькова', 'Лариса', 'Ильинична'), /* 19 */
       ('Яструб', 'Владимир', 'Данилович'), /* 20 */
       ('Мелашенко', 'Александр', 'Алексеевич'), /* 21 */
       ('Пономаренко', 'Владислов', 'Дмитриевич'), /* 22 */
       ('Хавалджи', 'Любовь', 'Амировна'), /* 23 */
       ('Пархоменко', 'Ирина', 'Владимировна'), /* 24 */
       ('Демидова', 'Алина', 'Александровна'), /* 25 */
       ('Лысенко', 'Елена', 'Егоровна'), /* 26 */
       ('Федосенко', 'Оксана', 'Владимировна'), /* 27 */
       ('Богатырева', 'Екатерина', 'Алексеевна'), /* 28 */
       ('Иванова', 'Валентина', 'Степановна'), /* 29 */
       ('Ильюшин', 'Сергей', 'Юрьевич');
/* 30 */


-- данные справочника врачебных специальностей
insert INTO Specialities
    (Speciality)
values ('терапевт'), /*  1 */
       ('стоматолог'), /*  2 */
       ('окулист'), /*  3 */
       ('кардиолог'), /*  4 */
       ('пульманолог'), /*  5 */
       ('хирург'), /*  6 */
       ('акушер'), /*  7 */
       ('отоларинголог'), /*  8 */
       ('инфекционист'), /*  9 */
       ('физиотерпевт'), /* 10 */
       ('онколог'), /* 11 */
       ('венеролог'), /* 12 */
       ('уролог');
/* 13 */


-- данные таблицы докторов
insert INTO Doctors
    (IdPerson, IdSpeciality, Price, [Percent])
values (1, 1, 110, 5.0), /*  1 */
       (2, 2, 600, 3.0), /*  2 */
       (3, 1, 160, 3.5), /*  3 */
       (4, 1, 250, 3.2), /*  4 */
       (5, 3, 300, 4.5), /*  5 */
       (6, 2, 600, 4.5), /*  6 */
       (7, 4, 300, 4.0), /*  7 */
       (8, 5, 250, 3.5), /*  8 */
       (9, 6, 800, 5.1), /*  9 */
       (10, 6, 1300, 4.5), /* 10 */
       (11, 2, 350, 3.1), /* 11 */
       (12, 1, 120, 6.2);
/* 12 */


-- данные таблицы пациентов
insert INTO Patients
    (IdPerson, BornDate, [Address], Passport)
values (13, '02-12-2001', 'ул. Садовая, д. 123, кв. 12', 'ЕС45718'), /*  1 */
       (14, '07-09-1991', 'ул. Зайцева, д. 2', 'АВ34524'), /*  2 */
       (15, '03-18-1963', 'пр. Титова, д. 11, кв. 91', 'АТ65423'), /*  3 */
       (16, '04-21-1957', 'ул. Содовая, д. 9', 'ВО12312'), /*  4 */
       (17, '02-12-2001', 'ул. Челюскинцев, д. 112, кв. 211', 'СК67443'), /*  5 */
       (18, '06-01-1935', 'пр. Титова, д. 9, кв. 21', 'ВА12234'), /*  6 */
       (19, '07-06-1992', 'пл. Конституции, д. 3, кв. 75', 'СО54334'), /*  7 */
       (20, '07-09-1991', 'пр. Мира, д. 3, кв. 64', 'ВС89532'), /*  8 */
       (21, '12-23-1947', 'ул. Содовая, д. 9, кв. 6', 'СС34267'), /*  9 */
       (22, '07-09-1991', 'ул. Садовая, д. 10', 'АТ23414'), /* 10 */
       (23, '09-29-1956', 'ул. Судовая, д. 1, кв. 91', 'СО98751'), /* 11 */
       (24, '04-13-1963', 'пр. Титова, д. 31, кв. 42', 'ВА32456'), /* 12 */
       (25, '04-21-1957', 'ул. Челюскинцев, д. 3', 'ВО98412'), /* 13 */
       (26, '02-12-2001', 'пр. Содовая, д. 13', 'АТ15321'), /* 14 */
       (27, '11-04-2001', 'пл. Конституции, д. 1, кв. 50', 'СС75198'), /* 15 */
       (28, '10-09-2001', 'ул. Щорса, д. 23, кв. 17', 'ЕС98415'), /* 16 */
       (29, '12-21-1998', 'ул. Овнатаняна, д. 4, кв. 98', 'АВ51591'), /* 17 */
       (30, '02-27-1997', 'ул. Чкалова, д. 11', 'АТ57484');
/* 18 */


-- данные таблицы врачебных приемов 
insert INTO Appointments
    (AppointmentDate, IdPatient, IdDoctor)
values ('10-21-2021', 1, 1), /*  1 */
       ('10-21-2021', 2, 1), /*  2 */
       ('10-21-2021', 3, 2), /*  3 */
       ('10-22-2021', 4, 3), /*  4 */
       ('10-22-2021', 4, 5), /*  5 */
       ('10-22-2021', 3, 5), /*  6 */
       ('12-22-2021', 2, 6), /*  7 */
       ('10-23-2021', 5, 2), /*  8 */
       ('10-23-2021', 6, 5), /*  9 */
       ('10-24-2021', 9, 6), /* 10 */
       ('12-22-2021', 7, 6), /* 11 */
       ('10-28-2021', 3, 7), /* 12 */
       ('10-28-2021', 2, 8), /* 13 */
       ('10-28-2021', 4, 9), /* 14 */
       ('11-02-2021', 6, 9), /* 15 */
       ('11-02-2021', 7, 1), /* 16 */
       ('11-02-2021', 8, 2), /* 17 */
       ('11-02-2017', 10, 2), /* 18 */
       ('11-03-2021', 5, 5), /* 19 */
       ('11-03-2021', 9, 7), /* 20 */
       ('11-03-2017', 6, 7); /* 21 */
